Repository: MahmoudAbdelkader5/FormBuilder.Net
Catalog: FormBuilder.Services/Resources/ValidationMessages.*.resx
Languages: ar

# VALIDATION_REQUIRED
source: The field '{0}' is required.
ar: الحقل '{0}' مطلوب.

# VALIDATION_INVALID_FORMAT
source: The field '{0}' has an invalid format.
ar: الحقل '{0}' له تنسيق غير صحيح.

# VALIDATION_INVALID_LENGTH
source: The field '{0}' must be between {1} and {2} characters.
ar: الحقل '{0}' يجب أن يكون بين {1} و {2} حرف.

# VALIDATION_DUPLICATE_VALUE
source: The value '{0}' already exists.
ar: القيمة '{0}' موجودة بالفعل.

# FIELDFIELD_CODE_EXISTS
source: Field code '{0}' already exists.
ar: رمز الحقل '{0}' موجود بالفعل.

# FIELDFIELD_NAME_EXISTS
source: Field name '{0}' already exists in this tab.
ar: اسم الحقل '{0}' موجود بالفعل في هذا التبويب.

# FORMBUILDER_CODE_EXISTS
source: Form code '{0}' already exists.
ar: رمز النموذج '{0}' موجود بالفعل.

# SERIES_CODE_EXISTS
source: Series code '{0}' already exists.
ar: رمز السلسلة '{0}' موجود بالفعل.

# DOCUMENTTYPE_CODE_EXISTS
source: Document type code '{0}' already exists.
ar: رمز نوع المستند '{0}' موجود بالفعل.

source: Field type not found.
ar: نوع الحقل غير موجود.

# FIELDTYPE_NAME_EXISTS
source: Field type name '{0}' already exists.
ar: اسم نوع الحقل '{0}' موجود بالفعل.

# FIELDTYPE_NAME_REQUIRED
source: Field type name is required.
ar: اسم نوع الحقل مطلوب.

# FIELDTYPE_DATATYPE_REQUIRED
source: Data type is required.
ar: نوع البيانات مطلوب.

# FIELDTYPE_IN_USE
source: Cannot delete field type: It is used {0} time(s).
ar: لا يمكن حذف نوع الحقل: يتم استخدامه {0} مرة.

# FIELDTYPE_INVALID_DATATYPE
source: Invalid data type. Valid types are: {0}.
ar: نوع بيانات غير صحيح. الأنواع الصحيحة هي: {0}.
